"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+ Adăugare";

"Add US bank account" = "Adăugați un cont bancar din SUA";

"Add a card" = "Adăugare card";

"Add a payment method" = "Adăugați o metodă de plată";

"Add card" = "Adăugare card";

"Add new card" = "Adăugare card nou";

"Add new payment method" = "Adăugare metodă de plată nouă";

"Add your payment information" = "Adăugați informațiile dvs. privind plata";

"Approve payment" = "Aprobare plată";

"Back" = "Înapoi";

"Bank" = "Bancă";

"Bank account" = "Cont bancar";

"Buy now or pay later with <img/>" = "Cumpărați acum sau plătiți mai târziu folosind <img/>";

"Buy now or pay later with Afterpay" = "Cumpărați acum sau plătiți mai târziu folosind Afterpay";

"Buy now or pay later with Clearpay" = "Cumpărați acum sau plătiți mai târziu folosind Clearpay";

"Buy now or pay later with Klarna" = "Cumpărați acum sau plătiți mai târziu folosind Klarna";

"Buy using a UPI ID" = "Cumpărați folosind un ID UPI";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Prin confirmarea plății cu PayPal, permiteți %@ să vă taxeze contul PayPal pentru plățile viitoare în conformitate cu termenii acesteia.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Prin continuarea către Amazon Pay, permiteți %@ să vă taxeze contul Amazon Pay pentru plățile viitoare în conformitate cu termenii acesteia.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Prin continuarea către Klarna, permiteți %1$@ să vă taxeze contul Klarna pentru plățile viitoare în conformitate cu termenii acesteia și termenii Klarna. Puteți schimba acest lucru în orice moment din aplicația dvs. Klarna sau contactându-ne la %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Prin continuarea cu PayPal, permiteți %@ să vă taxeze contul PayPal pentru plățile viitoare în conformitate cu termenii acesteia.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Prin continuarea cu Revolut Pay, permiteți %@ să vă taxeze contul Revolut Pay pentru plățile viitoare în conformitate cu termenii acesteia.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Continuând, sunteți de acord să autorizați plățile în conformitate cu <terms>acești termeni</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Continuând, autorizați %1$@ să debiteze contul dvs. Cash App pentru această plată și pentru plățile viitoare în conformitate cu termenii %2$@, până când această autorizație este revocată. Puteți schimba acest lucru oricând în setările Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Prin accesarea link-ului de asociere, sunteți de acord cu <terms>Termenii</terms> și <privacy>Politica de confidențialitate</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Prin furnizarea detaliilor contului dvs. bancar și confirmarea acestei plăți, sunteți de acord cu această Solicitare Direct Debit și cu <terms>Acordul de serviciu privind Solicitarea Direct Debit</terms> și autorizați Plățile Stripe Australia Pty Ltd ACN 160 180 343 număr ID utilizator Direct Debit 507156 („Stripe”) să vă debiteze contul prin intermediul Sistemului electronic de compensare colectivă (BECS) în numele %@ („Comerciantul”) pentru orice sume comunicate separat către dvs. de către Comerciant. Certificați faptul că sunteți fie un titular de cont, fie un semnatar autorizat în contul specificat mai sus.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Prin furnizarea informațiilor despre cardul dvs., permiteți %@ să vă taxeze cardul pentru plățile viitoare în conformitate cu termenii acesteia.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Prin furnizarea adresei de e-mail, sunteți de acord să creați un cont Link și să vă salvați informațiile de plată în Link, în conformitate cu <terms>Termenii</terms> și <privacy>Politica de confidențialitate</privacy> Link.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Prin furnizarea informațiilor dvs. privind plata și confirmarea acestei plăți, autorizați (A) %@ și Stripe, furnizorul nostru de servicii de plată, să trimită instrucțiuni băncii dvs. pentru a vă debita contul și pentru ca (B) banca dvs. să facă acest lucru în conformitate cu instrucțiunile respective. Conform drepturilor dvs., aveți dreptul la o rambursare din partea băncii dvs. în conformitate cu termenii și condițiile acordului dvs. cu aceasta. O rambursare trebuie revendicată în termen de opt săptămâni de la data debitării contului. Drepturile dvs. sunt explicate într-o declarație pe care o puteți obține de la bancă. Sunteți de acord să primiți notificări pentru debitări viitoare cu până la două zile înainte de efectuarea acestora.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Prin furnizarea numărului dvs. de telefon, sunteți de acord să creați un cont Link și să salvați informațiile dvs. de plată în Link, în conformitate cu <terms>Termenii</terms> și <privacy>Politica de confidențialitate</privacy> Link.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Prin salvarea contului dvs. bancar pentru %@ sunteți de acord să autorizați plățile în conformitate cu <terms>acești termeni</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Anulați și folosiți altă metodă de plată";

"Choose a payment method" = "Alegeți o metodă de plată";

"Close card scanner" = "Închidere scaner card";

"Confirm" = "Confirmare";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Confirmați plata în aplicația băncii dvs. sau în aplicația de plăți în termen de %@ pentru a finaliza achiziția.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Confirmați plata în aplicația băncii dvs. în termen de %@ pentru a finaliza achiziția.";

"Confirm your CVC" = "Confirmați-vă CVC-ul";

"Contact information" = "Informații de contact";

"EPS Bank" = "Banca EPS";

"Enter address manually" = "Introduceți adresa manual";

"FPX Bank" = "FPX Bank";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Înțeleg că Stripe va colecta debite directe în numele %@ și confirm că sunt titularul contului și singura persoană necesară pentru a autoriza debite din acest cont.";

"IBAN" = "IBAN";

"Manage payment method" = "Gestionare metodă de plată";

"Manage payment methods" = "Gestionare metode de plată";

"Manage your payment methods" = "Gestionați metodele de plată";

"Name on card" = "Numele titularului";

"New card" = "Card nou";

"New payment method" = "Metodă de plată nouă";

"Open your UPI app to approve your payment within %@" = "Deschideți aplicația UPI pentru a aproba plata în termen de %@";

"Or" = "Sau";

"Or pay using" = "Sau folosiți ca metodă de plată";

"Or pay with a card" = "Sau folosiți ca metodă de plată un card";

"Or use" = "Sau utilizați";

"Or use a card" = "Sau utilizați un card";

"Pay %@" = "Plătiți %@";

"Pay another way" = "Folosiți altă metodă de plată";

"Pay faster at %@ and thousands of businesses." = "Plătiți mai rapid la %@ și la alte mii de întreprinderi.";

"Pay over time with %@" = "Folosiți ca metodă de plată de-a lungul timpului %@";

"Pay over time with Affirm" = "Folosiți ca metodă de plată de-a lungul timpului Affirm";

"Pay with Link" = "Plătiți cu Link";

"Pay with your bank account in just a few steps." = "Plătiți cu contul dvs. bancar în doar câțiva pași.";

"Payment failed" = "Plata nu a reușit";

"Please go back and select another payment method" = "Vă rugăm să reveniți și să selectați o altă metodă de plată";

"Point the camera at your card." = "Îndreptați camera spre cardul dvs.";

"Processing..." = "Se procesează...";

"Przelewy24 Bank" = "Banca Przelewy24";

"Remove card?" = "Eliminați cardul?";

"Remove payment method" = "Eliminare metodă de plată";

"Save" = "Salvare";

"Save a new payment method" = "Salvați o metodă de plată nouă";

"Save address" = "Salvare adresă";

"Save for future payments" = "Salvați pentru plăți viitoare";

"Save payment details to %@ for future purchases" = "Salvați detaliile de plată pe %@ pentru achiziții viitoare";

"Save this account for future %@ payments" = "Salvați acest cont pentru plăți viitoare către %@";

"Save your bank account in just a few steps." = "Salvați-vă contul bancar în doar câțiva pași.";

"Save your info for secure 1-click checkout with Link" = "Salvați-vă informațiile pentru o finalizare securizată a comenzii cu un singur clic cu Link";

"Saved" = "Salvare efectuată";

"Select card" = "Selectare card";

"Select payment method" = "Selectare metodă de plată";

"Select your payment method" = "Selectați metoda de plată";

"Set up" = "Configurare";

"Shipping to %@ is not supported." = "Expedierea către %@ nu este acceptată.";

"Show menu" = "Afișare meniu";

"Simple, secure one-click payments" = "Plăți simple și securizate cu un singur clic";

"Something went wrong when linking your account.\nPlease try again later." = "Ceva nu a mers bine la asocierea contului dvs.\nVă rugăm să încercați din nou mai târziu.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe va depune 0,01 USD în contul dvs. în 1-2 zile lucrătoare. Apoi veți primi un e-mail cu instrucțiuni pentru a finaliza salvarea contului dvs. bancar cu %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe va depune 0,01 USD în contul dvs. în decurs de 1-2 zile lucrătoare. Apoi veți primi un e-mail cu instrucțiuni pentru a finaliza plata către %@.";

"The IBAN you entered is incomplete." = "Codul IBAN pe care l-ați introdus nu este complet.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Codul IBAN pe care l-ați introdus nu este valid, „%@” nu este un cod de țară acceptat.";

"Update" = "Actualizare";

"Update card brand" = "Actualizarea mărcii de card";

"View more" = "Vizualizați mai multe";

"Your IBAN should start with a two-letter country code." = "Codul dvs. IBAN trebuie să înceapă cu un cod de țară format din două litere.";

"iDEAL Bank" = "iDEAL Bank";
